
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br></pre></td><td class="code"><pre><span class="line">int main()</span><br><span class="line">&#123;</span><br><span class="line">    Base baseObj &#x3D; Base();</span><br><span class="line">    baseObj.func();</span><br><span class="line">    baseObj.printf();</span><br><span class="line">    Derived derivedObj &#x3D; Derived();</span><br><span class="line">    derivedObj.func();</span><br><span class="line">    derivedObj.printf();</span><br><span class="line"></span><br><span class="line">    Derived* pDerivedObj &#x3D; new Derived();</span><br><span class="line">    Base* pBaseObj &#x3D; pDerivedObj;</span><br><span class="line">    pDerivedObj-&gt;func();</span><br><span class="line">    pBaseObj-&gt;func();</span><br><span class="line">    pDerivedObj-&gt;printf();</span><br><span class="line">    pBaseObj-&gt;printf();</span><br><span class="line">    delete pDerivedObj;</span><br><span class="line">    return 0;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>


<p><strong>运行结果</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br></pre></td><td class="code"><pre><span class="line">Terminal output result:</span><br><span class="line"></span><br><span class="line">Base func()</span><br><span class="line">Base printf()</span><br><span class="line">Derived func()</span><br><span class="line">Derived printf()</span><br><span class="line"></span><br><span class="line">Derived func()</span><br><span class="line">Derived func()</span><br><span class="line">Derived printf()</span><br><span class="line">Base printf()</span><br></pre></td></tr></table></figure>

<p><strong>结果描述</strong></p>
<p>Base和Derived实例分别访问func()和printf()方法。运行结果为各自对应的func()和printf()方法输出。<br>pDerivedObj 和 pBaseObj指针分别指向了Derived实例的地址，对于 pDerivedObj 指针的操作表现出来它本身的方法输出，然而当我们把相同对象的地址赋给 pBaseObj 指针时，可以发现它的非虚函数printf()竟然表现出了父类的行为，并没有被重写的样子。那到底是什么原因造成了这样的结果呢？我们继续往下看虚函数表的介绍。</p>
<h1 id="虚函数表以及内存布局"><a href="#虚函数表以及内存布局" class="headerlink" title="虚函数表以及内存布局"></a>虚函数表以及内存布局</h1><p>虚函数（Virtual Function）是通过一张虚函数表（Virtual Table）来实现的。简称为V-Table。在这个表中，主是要一个类的虚函数的地址表，这张表解决了继承、覆盖的问题，保证其容真实反应实际的函数。这样，在有虚函数的类的实例中这个表被分配在了这个实例的内存中，所以，当我们用父类的指针来操作一个子类的时候，这张虚函数表就显得由为重要了，它就像一个地图一样，指明了实际所应该调用的函数。</p>
<p>这里我们着重看一下这张虚函数表。C++的编译器应该是保证虚函数表的指针存在于对象实例中最前面的位置（这是为了保证取到虚函数表的有最高的性能——如果有多层继承或是多重继承的情况下）。 这意味着我们通过对象实例的地址得到这张虚函数表，然后就可以遍历其中函数指针，并调用相应的函数。</p>
<p><strong>示例代码(一下示例代码编译环境是X86并且采用4byte对齐)</strong></p>
<p><strong>非虚函数类</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p><strong>内存布局情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">  class Base1	size(8):</span><br><span class="line">  	+---</span><br><span class="line">   0	| a</span><br><span class="line">   4	| c</span><br><span class="line">    	| &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  	+---</span><br><span class="line">+---</span><br></pre></td></tr></table></figure>
<p>博主未来为了让同学们注意一下在类内存布局中常见的字节对齐问题，就专门在Base1类中添加了char c变量。可以很清晰的看出在内存中a和c成员变量依据声明的顺序进行排列（类内偏移为0开始）并且有3字节用于对齐，成员函数不占内存空间。</p>
<p><strong>单继承派生类不含非虚函数</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int c;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p><strong>内存布局情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass	size(12):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | a</span><br><span class="line"> 4	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line"> 8	| c</span><br><span class="line">	+---</span><br></pre></td></tr></table></figure>
<p>可以看到子类DerivedClass继承了父类Base1的成员变量，在内存排布上，先是排布了父类的成员变量，接着排布子类的成员变量，同样，成员函数不占字节。</p>
<p><strong>存在虚函数类</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p><strong>内存分布情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">class Base1	size(12):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vfptr&#125;</span><br><span class="line"> 4	| a</span><br><span class="line"> 8	| c</span><br><span class="line">  	| &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Base1::$vftable@:</span><br><span class="line">	| &amp;Base1_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br></pre></td></tr></table></figure>
<p>这个内存结构图分成了两个部分，上面是内存分布，下面是虚表，我们逐个看一下。从上图可以看出虚表指针放在了内存的开始处（0地址偏移），然后再是成员变量；下面生成了虚表，紧跟在&amp;Base1_meta后面的0表示，这张虚表对应的虚指针在内存中的分布，下面列出了虚函数，左侧的0是这个虚函数的序号，因为博主只写了一个虚函数，所以只有一项，如果有多个虚函数，会有序号为1，为2的虚函数列出来。</p>
<p>通过上面这个例子有同学就问了<strong>虚表指针以及虚表是什么时候创建的呢？</strong> 构造函数创建的时候即类对象实例化的时候就创建的。那么<strong>如何利用虚表指针与虚表来实现多态的呢？</strong> 当创建一个含有虚函数的父类的对象时，编译器在对象构造时将虚表指针指向父类的虚函数；同样，当创建子类的对象时，编译器在构造函数里将虚表指针（子类只有一个虚表指针，它来自父类）指向子类的虚表（这个虚表里面的虚函数入口地址是子类的）从而可以实现多态。</p>
<p><strong>单继承派生类中也有虚函数并且存在覆盖继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int d;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p><strong>内存分布情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | a</span><br><span class="line"> 8	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line">12	| d</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedClass::$vftable@:</span><br><span class="line">	| &amp;DerivedClass_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;DerivedClass::VirtualFunction</span><br></pre></td></tr></table></figure>
<p>上半部是内存分布，可以看到，虚表指针被继承了，且仍位于内存排布的起始处，下面是父类的成员变量a和c，最后是子类的成员变量d，注意虚表指针只有一个，子类并没有再生成虚表指针了；下半部的虚表情况与父类是一样的由于子类将父类的虚函数方法重写了即产生的虚表序号只有一个。</p>
<p><strong>单继承派生类中也有虚函数并且不存在覆盖继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int d;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction1() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p><strong>内存布局情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | a</span><br><span class="line"> 8	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line">12	| d</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedClass::$vftable@:</span><br><span class="line">	| &amp;DerivedClass_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass::VirtualFunction1</span><br></pre></td></tr></table></figure>
<p>此种情况内存分布中上半部分也只有一个虚表指针变量内存分布依次排列，但是下方虚表的内容变化了，虚表的0号是父类的VirtualFunction，而1号放的是子类的VirtualFunction2。也就是说，如果定义了DerivedClass的对象，那么在构造时，虚表指针就会指向这个虚表，以后如果调用的是VirtualFunction，那么会从父类中寻找对应的虚函数，如果调用的是VirtualFunction1，那么会从子类中寻找对应的虚函数。</p>
<p><strong>单继承派生类中即存在覆盖虚函数也存在非覆盖虚函数继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int c;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction1() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>


<p><strong>内存布局情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br></pre></td><td class="code"><pre><span class="line">class DerivedClass	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | a</span><br><span class="line"> 8	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line">12	| c</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedClass::$vftable@:</span><br><span class="line">	| &amp;DerivedClass_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;DerivedClass::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass::VirtualFunction1</span><br></pre></td></tr></table></figure>
<p>根据上面的内存布局情况，我们既重写了父类的虚函数，也有新添的虚函数，最终虚函数表0号和1号都是子类对应的虚函数地址。</p>
<p><strong>多继承派生类中存在覆盖虚函数继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass1 : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int b;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass2 : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int d;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedDerivedClass : public DerivedClass1, public DerivedClass2</span><br><span class="line">&#123;</span><br><span class="line">	int e;</span><br><span class="line">public:</span><br><span class="line">	void DerivedDerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p><strong>内存布局</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br></pre></td><td class="code"><pre><span class="line">class Base1	size(12):</span><br><span class="line">+---</span><br><span class="line">0	| &#123;vfptr&#125;</span><br><span class="line">4	| a</span><br><span class="line">8	| c</span><br><span class="line">    | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">+---</span><br><span class="line"></span><br><span class="line">Base1::$vftable@:</span><br><span class="line">| &amp;Base1_meta</span><br><span class="line">|  0</span><br><span class="line">0	| &amp;Base1::VirtualFunction</span><br><span class="line"></span><br><span class="line">class DerivedClass1	size(16):</span><br><span class="line">  	+---</span><br><span class="line">   0	| +--- (base class Base1)</span><br><span class="line">   0	| | &#123;vfptr&#125;</span><br><span class="line">   4	| | a</span><br><span class="line">   8	| | c</span><br><span class="line">    	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  	| +---</span><br><span class="line">  12	| b</span><br><span class="line">  	+---</span><br><span class="line"></span><br><span class="line">  DerivedClass1::$vftable@:</span><br><span class="line">  	| &amp;DerivedClass1_meta</span><br><span class="line">  	|  0</span><br><span class="line">   0	| &amp;DerivedClass1::VirtualFunction</span><br><span class="line"></span><br><span class="line">  DerivedClass1::VirtualFunction this adjustor: 0</span><br><span class="line"></span><br><span class="line">  class DerivedClass2	size(16):</span><br><span class="line">  	+---</span><br><span class="line">   0	| +--- (base class Base1)</span><br><span class="line">   0	| | &#123;vfptr&#125;</span><br><span class="line">   4	| | a</span><br><span class="line">   8	| | c</span><br><span class="line">    	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  	| +---</span><br><span class="line">  12	| d</span><br><span class="line">  	+---</span><br><span class="line"></span><br><span class="line">  DerivedClass2::$vftable@:</span><br><span class="line">  	| &amp;DerivedClass2_meta</span><br><span class="line">  	|  0</span><br><span class="line">   0	| &amp;DerivedClass2::VirtualFunction</span><br><span class="line"></span><br><span class="line">  DerivedClass2::VirtualFunction this adjustor: 0</span><br><span class="line"></span><br><span class="line">  class DerivedDerivedClass	size(36):</span><br><span class="line">  	+---</span><br><span class="line">   0	| +--- (base class DerivedClass1)</span><br><span class="line">   0	| | +--- (base class Base1)</span><br><span class="line">   0	| | | &#123;vfptr&#125;</span><br><span class="line">   4	| | | a</span><br><span class="line">   8	| | | c</span><br><span class="line">    	| | | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  	| | +---</span><br><span class="line">  12	| | b</span><br><span class="line">  	| +---</span><br><span class="line">  16	| +--- (base class DerivedClass2)</span><br><span class="line">  16	| | +--- (base class Base1)</span><br><span class="line">  16	| | | &#123;vfptr&#125;</span><br><span class="line">  20	| | | a</span><br><span class="line">  24	| | | c</span><br><span class="line">    	| | | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  	| | +---</span><br><span class="line">  28	| | d</span><br><span class="line">  	| +---</span><br><span class="line">  32	| e</span><br><span class="line">  	+---</span><br><span class="line"></span><br><span class="line">  DerivedDerivedClass::$vftable@DerivedClass1@:</span><br><span class="line">  	| &amp;DerivedDerivedClass_meta</span><br><span class="line">  	|  0</span><br><span class="line">   0	| &amp;DerivedDerivedClass::VirtualFunction</span><br><span class="line"></span><br><span class="line">  DerivedDerivedClass::$vftable@DerivedClass2@:</span><br><span class="line">  	| -16</span><br><span class="line">   0	| &amp;thunk: this-&#x3D;16; goto DerivedDerivedClass::VirtualFunction</span><br></pre></td></tr></table></figure>
<p>根据上面的内存分布情况，此多继承覆盖情况，我分别把每个类的内存分布都打了出来，下面我们重点看看这个类DerivedDerivedClass，由外向内看，它并列地排布着继承而来的两个父类DerivedClass1与DerivedClass2，还有自身的成员变量e。DerivedClass1包含了它的成员变量b，以及Base1，Base1有一个0地址偏移的虚表指针，然后是成员变量a和c；DerivedClass2的内存排布类似于DerivedClass1，注意到DerivedClass2里面竟然也有一份Base1。<br>我们再来看看虚表继承情况，我们看到了有两份虚表了，分别针对DerivedClass1与DerivedClass2，在&amp;DerivedDericedClass_meta下方的数字是首地址偏移量0也是DerivedClass1中的{vfptr}虚函数指针在DerivedDerivedClass的内存偏移，靠下面的虚表的那个-16表示指向这个虚表的虚指针的内存偏移，这正是DerivedClass2中的{vfptr}在DerivedDerivedClass的内存偏移。</p>
<p><strong>DerivedDerivedClass()的虚表的VirtualFunction()指针</strong><br><img src="/img/loading.gif" class="lazyload" data-src="https://github.com/FrederickHou/FrederickHou.github.io/blob/master/img/c++%E8%99%9A%E5%87%BD%E6%95%B01.png?raw=true" alt></p>
<p><strong>多继承派生类中不存在覆盖虚函数继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass1 : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int b;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction1() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass2 : public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int d;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction2() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedDerivedClass : public DerivedClass1, public DerivedClass2</span><br><span class="line">&#123;</span><br><span class="line">	int e;</span><br><span class="line">public:</span><br><span class="line">	void DerivedDerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction3() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>

<p><strong>内存布局情况</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br></pre></td><td class="code"><pre><span class="line">  class Base1	size(12):</span><br><span class="line">  +---</span><br><span class="line">  0	| &#123;vfptr&#125;</span><br><span class="line">  4	| a</span><br><span class="line">  8	| c</span><br><span class="line">      | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">  +---</span><br><span class="line"></span><br><span class="line">  Base1::$vftable@:</span><br><span class="line">  | &amp;Base1_meta</span><br><span class="line">  |  0</span><br><span class="line">  0	| &amp;Base1::VirtualFunction</span><br><span class="line"></span><br><span class="line">class DerivedClass1	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | a</span><br><span class="line"> 8	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line">12	| b</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedClass1::$vftable@:</span><br><span class="line">	| &amp;DerivedClass1_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass1::VirtualFunction1</span><br><span class="line"></span><br><span class="line">DerivedClass1::VirtualFunction1 this adjustor: 0</span><br><span class="line"></span><br><span class="line">class DerivedClass2	size(16):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Base1)</span><br><span class="line"> 0	| | &#123;vfptr&#125;</span><br><span class="line"> 4	| | a</span><br><span class="line"> 8	| | c</span><br><span class="line">  	| | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| +---</span><br><span class="line">12	| d</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedClass2::$vftable@:</span><br><span class="line">	| &amp;DerivedClass2_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass2::VirtualFunction2</span><br><span class="line"></span><br><span class="line">DerivedClass2::VirtualFunction2 this adjustor: 0</span><br><span class="line"></span><br><span class="line">class DerivedDerivedClass	size(36):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class DerivedClass1)</span><br><span class="line"> 0	| | +--- (base class Base1)</span><br><span class="line"> 0	| | | &#123;vfptr&#125;</span><br><span class="line"> 4	| | | a</span><br><span class="line"> 8	| | | c</span><br><span class="line">  	| | | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| | +---</span><br><span class="line">12	| | b</span><br><span class="line">	| +---</span><br><span class="line">16	| +--- (base class DerivedClass2)</span><br><span class="line">16	| | +--- (base class Base1)</span><br><span class="line">16	| | | &#123;vfptr&#125;</span><br><span class="line">20	| | | a</span><br><span class="line">24	| | | c</span><br><span class="line">  	| | | &lt;alignment member&gt; (size&#x3D;3)</span><br><span class="line">	| | +---</span><br><span class="line">28	| | d</span><br><span class="line">	| +---</span><br><span class="line">32	| e</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">DerivedDerivedClass::$vftable@DerivedClass1@:</span><br><span class="line">	| &amp;DerivedDerivedClass_meta</span><br><span class="line">	|  0</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass1::VirtualFunction1</span><br><span class="line"> 2	| &amp;DerivedDerivedClass::VirtualFunction3</span><br><span class="line"></span><br><span class="line">DerivedDerivedClass::$vftable@DerivedClass2@:</span><br><span class="line">	| -16</span><br><span class="line"> 0	| &amp;Base1::VirtualFunction</span><br><span class="line"> 1	| &amp;DerivedClass2::VirtualFunction2</span><br></pre></td></tr></table></figure>
<p>此种情况的内存分布和覆盖多继承一样，唯一注意的就是在多继承中成员虚函数地址会保存到第一个继承父类的虚函数表。</p>
<p><strong>多继承之虚继承派生类中存在覆盖虚函数继承</strong></p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br></pre></td><td class="code"><pre><span class="line">class Base1</span><br><span class="line">&#123;</span><br><span class="line">	int a;</span><br><span class="line">	char c;</span><br><span class="line">public:</span><br><span class="line">	void CommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass1 : virtual public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int b;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction1() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedClass2 : virtual public Base1</span><br><span class="line">&#123;</span><br><span class="line">	int d;</span><br><span class="line">public:</span><br><span class="line">	void DerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction2() &#123;&#125;;</span><br><span class="line">&#125;;</span><br><span class="line"></span><br><span class="line">class DerivedDerivedClass : public DerivedClass1, public DerivedClass2</span><br><span class="line">&#123;</span><br><span class="line">	int e;</span><br><span class="line">public:</span><br><span class="line">	void DerivedDerivedCommonFunction() &#123;&#125;;</span><br><span class="line">	void virtual VirtualFunction3() &#123;&#125;;</span><br><span class="line">&#125;;</span><br></pre></td></tr></table></figure>
<p><strong>内存分布情况</strong></p>
